docs/rust-mpc-dependency-library.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-07-10 Fri 16:59 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>多方安全计算原理与相关库介绍</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">多方安全计算原理与相关库介绍</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7aa19d6">1. 多方安全计算相关</a>
<ul>
<li><a href="#orgdbda726">1.1. byteorder</a></li>
<li><a href="#org8db5619">1.2. bit-vec</a></li>
<li><a href="#org6efa6f0">1.3. num-traits</a></li>
<li><a href="#org93c785c">1.4. ndarray</a></li>
<li><a href="#orga2e3a7b">1.5. rayon</a></li>
<li><a href="#org87f3aba">1.6. blake2</a></li>
<li><a href="#org6abae82">1.7. rand_chacha</a></li>
<li><a href="#org5e236ce">1.8. npy, npy-derive</a></li>
<li><a href="#org77f1688">1.9. tch</a></li>
<li><a href="#org44e9878">1.10. ocelot</a></li>
<li><a href="#org54ace26">1.11. scuttlebutt</a></li>
<li><a href="#orgab9a374">1.12. bincode</a></li>
<li><a href="#org3c7a61b">1.13. io-utils</a></li>
</ul>
</li>
<li><a href="#org0a3e307">2. 通用</a>
<ul>
<li><a href="#org0285e84">2.1. derivative</a></li>
<li><a href="#org0228af4">2.2. clippy</a></li>
<li><a href="#org5eb6f0e">2.3. failure</a></li>
<li><a href="#org081b65e">2.4. colored</a></li>
<li><a href="#orge4b5134">2.5. criterion</a></li>
<li><a href="#orgb18e807">2.6. std::io</a></li>
<li><a href="#orgf99cd75">2.7. macro_rules!</a></li>
<li><a href="#org7b62fc4">2.8. #[inline]</a></li>
<li><a href="#org505e60e">2.9. std::io::Cursor</a></li>
<li><a href="#org1e3888b">2.10. std::marker::PhantomData</a></li>
<li><a href="#orgb2ae8b3">2.11. bindgen</a></li>
<li><a href="#orgaad4fd4">2.12. cmake</a></li>
<li><a href="#org40b74c7">2.13. crossbeam</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7aa19d6" class="outline-2">
<h2 id="org7aa19d6"><span class="section-number-2">1.</span> 多方安全计算相关</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdbda726" class="outline-3">
<h3 id="orgdbda726"><span class="section-number-3">1.1.</span> byteorder</h3>
<div class="outline-text-3" id="text-1-1">
<p>
用途：以大端或小端的方式对二进制数字进行编码和解码。
</p>
</div>
</div>
<div id="outline-container-org8db5619" class="outline-3">
<h3 id="org8db5619"><span class="section-number-3">1.2.</span> bit-vec</h3>
<div class="outline-text-3" id="text-1-2">
<p>
用途：现在看来和素数相关，未详。
</p>

<p>
ref：<a href="https://contain-rs.github.io/bit-vec/bit_vec/">https://contain-rs.github.io/bit-vec/bit_vec/</a>
</p>
</div>
</div>
<div id="outline-container-org6efa6f0" class="outline-3">
<h3 id="org6efa6f0"><span class="section-number-3">1.3.</span> num-traits</h3>
<div class="outline-text-3" id="text-1-3">
<p>
用途：为通用数学中所存在的traits所构建的collection
</p>
</div>
</div>
<div id="outline-container-org93c785c" class="outline-3">
<h3 id="org93c785c"><span class="section-number-3">1.4.</span> ndarray</h3>
<div class="outline-text-3" id="text-1-4">
<p>
用途：rust中的numpy
</p>
</div>
</div>
<div id="outline-container-orga2e3a7b" class="outline-3">
<h3 id="orga2e3a7b"><span class="section-number-3">1.5.</span> rayon</h3>
<div class="outline-text-3" id="text-1-5">
<p>
用途：并行计算库
</p>
</div>
</div>
<div id="outline-container-org87f3aba" class="outline-3">
<h3 id="org87f3aba"><span class="section-number-3">1.6.</span> blake2</h3>
<div class="outline-text-3" id="text-1-6">
<p>
用途：hash function blake2的封装
</p>
</div>
</div>
<div id="outline-container-org6abae82" class="outline-3">
<h3 id="org6abae82"><span class="section-number-3">1.7.</span> rand_chacha</h3>
<div class="outline-text-3" id="text-1-7">
<p>
使用chacha算法的随机数生成器
</p>
</div>
</div>
<div id="outline-container-org5e236ce" class="outline-3">
<h3 id="org5e236ce"><span class="section-number-3">1.8.</span> npy, npy-derive</h3>
<div class="outline-text-3" id="text-1-8">
<p>
用以读取和写入numpy库所用到的npy文件。
</p>
</div>
</div>
<div id="outline-container-org77f1688" class="outline-3">
<h3 id="org77f1688"><span class="section-number-3">1.9.</span> tch</h3>
<div class="outline-text-3" id="text-1-9">
<p>
C++ pytorch库的rust绑定
</p>
</div>
</div>
<div id="outline-container-org44e9878" class="outline-3">
<h3 id="org44e9878"><span class="section-number-3">1.10.</span> ocelot</h3>
<div class="outline-text-3" id="text-1-10">
<p>
不经意传输的rust实现
</p>
</div>
</div>
<div id="outline-container-org54ace26" class="outline-3">
<h3 id="org54ace26"><span class="section-number-3">1.11.</span> scuttlebutt</h3>
<div class="outline-text-3" id="text-1-11">
<p>
多方安全计算相关的基础library
</p>
</div>
</div>
<div id="outline-container-orgab9a374" class="outline-3">
<h3 id="orgab9a374"><span class="section-number-3">1.12.</span> bincode</h3>
<div class="outline-text-3" id="text-1-12">
<p>
对变量进行编码和解码
</p>
</div>
</div>
<div id="outline-container-org3c7a61b" class="outline-3">
<h3 id="org3c7a61b"><span class="section-number-3">1.13.</span> io-utils</h3>
<div class="outline-text-3" id="text-1-13">
<p>
network wrappers
</p>
</div>
</div>
</div>
<div id="outline-container-org0a3e307" class="outline-2">
<h2 id="org0a3e307"><span class="section-number-2">2.</span> 通用</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0285e84" class="outline-3">
<h3 id="org0285e84"><span class="section-number-3">2.1.</span> derivative</h3>
<div class="outline-text-3" id="text-2-1">
<p>
derivative是常用的依赖，他可以自动化地为一些自定义的enum或struct提供一些标准的trait，如构造函数Defualt，用于复制的Copy和Clone，等等。
</p>

<p>
参考连接：<a href="https://mcarton.github.io/rust-derivative/latest/index.html">https://mcarton.github.io/rust-derivative/latest/index.html</a>
</p>
</div>
</div>
<div id="outline-container-org0228af4" class="outline-3">
<h3 id="org0228af4"><span class="section-number-3">2.2.</span> clippy</h3>
<div class="outline-text-3" id="text-2-2">
<p>
用途：代码规范。
</p>

<p>
ref：<a href="https://github.com/rust-lang/rust-clippy">https://github.com/rust-lang/rust-clippy</a>
</p>
</div>
</div>
<div id="outline-container-org5eb6f0e" class="outline-3">
<h3 id="org5eb6f0e"><span class="section-number-3">2.3.</span> failure</h3>
<div class="outline-text-3" id="text-2-3">
<p>
用途：错误处理库
</p>
</div>
</div>
<div id="outline-container-org081b65e" class="outline-3">
<h3 id="org081b65e"><span class="section-number-3">2.4.</span> colored</h3>
<div class="outline-text-3" id="text-2-4">
<p>
用途：colored outputs
</p>
</div>
</div>
<div id="outline-container-orge4b5134" class="outline-3">
<h3 id="orge4b5134"><span class="section-number-3">2.5.</span> criterion</h3>
<div class="outline-text-3" id="text-2-5">
<p>
用途：评估代码块，代码测速
</p>
</div>
</div>
<div id="outline-container-orgb18e807" class="outline-3">
<h3 id="orgb18e807"><span class="section-number-3">2.6.</span> std::io</h3>
<div class="outline-text-3" id="text-2-6">
<p>
io opearation of rust. It provides two tratis: Read and Write.
</p>
</div>
</div>
<div id="outline-container-orgf99cd75" class="outline-3">
<h3 id="orgf99cd75"><span class="section-number-3">2.7.</span> macro_rules!</h3>
<div class="outline-text-3" id="text-2-7">
<p>
create macro for rust.
</p>
</div>
</div>
<div id="outline-container-org7b62fc4" class="outline-3">
<h3 id="org7b62fc4"><span class="section-number-3">2.8.</span> #[inline]</h3>
<div class="outline-text-3" id="text-2-8">
<p>
an <code>inline</code> features, which suggests the compiler inline this function.
</p>
</div>
</div>
<div id="outline-container-org505e60e" class="outline-3">
<h3 id="org505e60e"><span class="section-number-3">2.9.</span> std::io::Cursor</h3>
<div class="outline-text-3" id="text-2-9">
<p>
the buffer of memory in rust.
</p>

<p>
see: <a href="https://doc.rust-lang.org/std/io/struct.Cursor.html">https://doc.rust-lang.org/std/io/struct.Cursor.html</a>
</p>
</div>
</div>
<div id="outline-container-org1e3888b" class="outline-3">
<h3 id="org1e3888b"><span class="section-number-3">2.10.</span> std::marker::PhantomData</h3>
<div class="outline-text-3" id="text-2-10">
<p>
幽灵数据，Phantomdata&lt;T&gt;是一个范型变量，表示类型为T的变量可能存在
</p>
</div>
</div>
<div id="outline-container-orgb2ae8b3" class="outline-3">
<h3 id="orgb2ae8b3"><span class="section-number-3">2.11.</span> bindgen</h3>
<div class="outline-text-3" id="text-2-11">
<p>
为C或C++生成rust bings
</p>
</div>
</div>
<div id="outline-container-orgaad4fd4" class="outline-3">
<h3 id="orgaad4fd4"><span class="section-number-3">2.12.</span> cmake</h3>
<div class="outline-text-3" id="text-2-12">
<p>
通过使用cmake来为rust构建C++的native labrary
</p>
</div>
</div>
<div id="outline-container-org40b74c7" class="outline-3">
<h3 id="org40b74c7"><span class="section-number-3">2.13.</span> crossbeam</h3>
<div class="outline-text-3" id="text-2-13">
<p>
并法编程相关
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:liangzid@stu.xjtu.edu.cn">liangzid@stu.xjtu.edu.cn</a>)</span> <span class="date">Create Date: Fri Feb  3 14:31:38 2023</span> <span class="date">Last modified: 2026-05-12 Tue 20:20</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.90 (<a href="https://orgmode.org">Org</a> mode 9.8.5)</span> </div>
</div>
</body>
</html>
